grouper-ws/grouper-ws/doc/xmlExamples/viewOrEditAttributesSimpleSoapRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Body>
    <ns1:viewOrEditAttributesSimple xmlns:ns1="http://webservices.grouper.middleware.internet2.edu/xsd">
      <ns1:groupName>aStem:aGroup</ns1:groupName>
      <ns1:groupUuid></ns1:groupUuid>
      <ns1:attributeName0>description</ns1:attributeName0>
      <ns1:attributeValue0>some description</ns1:attributeValue0>
      <ns1:attributeDelete0></ns1:attributeDelete0>
      <ns1:attributeName1>description</ns1:attributeName1>
      <ns1:attributeValue1>some description</ns1:attributeValue1>
      <ns1:attributeDelete1></ns1:attributeDelete1>
      <ns1:attributeName2></ns1:attributeName2>
      <ns1:attributeValue2></ns1:attributeValue2>
      <ns1:attributeDelete2></ns1:attributeDelete2>
      <ns1:actAsSubjectId>GrouperSystem</ns1:actAsSubjectId>
      <ns1:actAsSubjectIdentifier></ns1:actAsSubjectIdentifier>
    </ns1:viewOrEditAttributesSimple>
  </soapenv:Body>
</soapenv:Envelope>